class TextConstants {
  static const String price = '￥11499';
  static const String promotion = '花呗/掌上生活分期直购，最高可享12期0分期利息';
  static const String detailsTitle = '新机详情';
  static const String promotionDetails =
      '①夏日礼遇，限时直降活动时间6月28日00:00-7月31日23:59 ②12期0分期利息（微信小程序尚不支持，请前往APP端使用）';

  static const String productDescription =
      '''一天我的实习指导老师张雨欣把我叫到她的房间，郑重其事地告诉我徐校长找她谈话，安排了一个重要的任务，要我们合作，近期内完成对校门口宣传墙的绘画制作任务。将原先的标语口号，改成一幅宣传画，以迎接年底全区教育改革大检查和评比。
　　于是我们便坐下来，共同商议宣传画绘制的具体操作：就宣传画的内容、表现形式和制作材料等问题做了探讨。她首先征求我的意见，问画什么样的宣传画合适，我稍作思考以后说："我觉得绘制写实性的宣传画比较合适，那样看起来雄壮气魄，能吸引眼球。"我之所以这样说 ，是建立在自信基础之上的，同时也想借此机会炫耀自己的绘画技能，以博得学校和老师的崇拜好感。张老师充分肯定了我的设想和决心，说："你的想法很好，我也相信你有这个能力把它完成好，但我们还是应该考虑实际情况。在不影响正常教学工作的前提下，十天之内完成一项这样大的工程，时间上能否来得赢？另外，完成这张画的工具材料复杂、成本高、能否采购到位还是问题？最主要的是，我们是一所农村乡镇小学，采用与表现孩子们能接受的，喜闻乐见的表现形式，比如装饰性的绘画，更符合孩子们的欣赏习惯和能力，而且所需材料单纯，制作方法相对简单易操作，你看如何？"
　　听过她的这番讲述，让我不得不对她刮目相看，佩服她考虑问题之缜密、客观、全面。我完全同意她的观点，之后见她拿出一本版面设计彩色绘本画册，选择了几幅图画，征求我的意见，我比较后提出了画左边这副画，她说自己也倾向于画这幅宣传画。
　　在谈到我们的任务分工时，她谦虚地对我说："我考虑了一下，这幅壁画主要由你来唱主角，你是美术科班出身的高材生，专业过硬，我也想利用这次机会，好好向你学习。更重要的是，你目前面临毕业分配，实习表现好可以为你增光添彩，对工作分配有利。另外我们作为教学相长，在一起朝夕相处这么久，又第一次合作绘制巨幅壁画，它是我们共同奋斗的纪念与见证，可谓是意义非凡！"
　　她先入为主、成人之美的给我一通鼓励，让我很感动，通过这段时间对她的观察和了解，张老师虽只是中师学历，但她的教学能力、专业技术水平绝对不亚于大学本科水平，只要是美术业内人士看过她的国画作品都会有此同感。象她红二代天之骄子的特殊身份，能有这般的建树实属罕见。更让我仰慕的是，她能安心乡镇小学平凡岗位工作，从不摆高干子女的架子，与大家和睦相处，谦虚好学，受到师生的好评，反映了她良好的品格、家教和修养。说干就干，我们马上拟订了一份颜料、画笔等绘画材料采购清单。她告诉我，明天周末趁回家到县城找专门的绘画用品商店购买。她说话、办事向来雷厉风行，绝不拖泥带水。
　　三天后的周一，我们一切工作准备就绪，等同学们上午放学之后，我们就开始了宣传画的绘制工作。这一方独立的宣传墙面有三米高，四米宽，正对着学校大门口。考虑到周一至周五都要正常上课，我们尽量利用周末和每天的中午和下午放学之后工作，墙面的高处够不着，我们向学校木工师傅借了一张做工专用的长条凳。
　　刚开始，一切运作还算正常。我花了半天的时间，用铅笔打好画面草稿，张老师用长尺打好格子，又用三角板写上了宣传画的标题"未来在于教育"的美术字草图。第二天我们就见缝插针的开始了用颜色绘制画面。随着时间的推移，加之天工作美，我们在绘制过程中，尽管遇到不少困难和问题，但最终都被一 一克服，配合默契，宣传壁画整体效果初步显现，大家普遍反映良好。认为宣传画主题突出、画面美观、强烈、颜色艳而不俗、让每一位进入校园的师生员工在踏入学校大门口的一瞬间，就有耳目一新，精神振奋的感觉。毫不夸张的说，宣传壁画给这个红色老区小镇带来了光彩和荣耀，徐校长不止一次的夸赞我们为学校做了一件好事。''';
}
